[{
        "Category": "Lifestyle",
        "Creators Name": "JustAli",
        "About Paragraph": "Ali's \"big sister\" vibes in her \"Have a Book Sleepover\" series and others have resulted in an engaged and loyal following that watch Ali not just for her book suggestions, but also her night-time routine and lifestyle choices too. Brands like Notion, Curology and Grammarly have all benefited from partnerships with Ali. Her creativity with video topics and ensuring organic brand integrations make Ali one of SmallScreen's most in-demand creators on the roster. In addition to growing followings on YouTube, TikTok and Instagram, Ali has 15,000+ members in her \"On the Same Page\" digital book club.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC2l7c0_9kctwugTLEKoI5mQ",
        "Youtube Followers": "182K",
        "instagram_url": "https://www.instagram.com/aliigood",
        "Instagram Followers": "35.4K",
        "tiktok_url": "https://www.tiktok.com/@justaliiii",
        "Tik Tok Followers": "51.2K",
        "id": 1
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "The Book Leo",
        "About Paragraph": "Meet Leonie, the creator who redefines BookTube with a fresh perspective. From \"dramione\" fan-fiction deep dives, to captivating Young Adult Fantasy retrospectives and thought-provoking editorials on TikTok's impact on reading, she's a rising star. Her cozy and comforting aesthetic and sharp book commentary make her one of BookTube's prominent creators. Join Leonie on this literary journey, and let's explore the enchanting world of books together!",
        "Country": "Netherlands",
        "youtube_url": "https://www.youtube.com/channel/UCkSMDOtrKr43OGSSmKnx6tQ",
        "Youtube Followers": "560K",
        "instagram_url": "https://www.instagram.com/thebookleo",
        "Instagram Followers": "81.2K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 2
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Big Book Lady",
        "About Paragraph": "You won't find Lauren following the typical YA Romantasy #BookTok trends. Instead, Lauren carves out her own content nook exploring the world of literary fiction, often from the public library or independent book store, with recommended reads for your next hot girl summer, cozy Sunday and more.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCpveh4-PMNuDG_QIDdCOXYA",
        "Youtube Followers": "66.1K ",
        "instagram_url": "https://www.instagram.com/bigbooklady",
        "Instagram Followers": "103K",
        "tiktok_url": "https://www.tiktok.com/@bigbooklady",
        "Tik Tok Followers": "265.1K",
        "id": 3
    },
    {
        "Category": "Comedy",
        "Creators Name": "Colleen Landry",
        "About Paragraph": "Colleen Landry provides a humorous take on family life and everyday situations. Her content includes comedic skits and relatable family scenarios, offering a light-hearted approach to home and family topics.",
        "Country": "Canada",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/colleenlandrycomedy",
        "Instagram Followers": "218K",
        "tiktok_url": "https://www.tiktok.com/@colleenlandrycomedy",
        "Tik Tok Followers": "163.9K\n",
        "id": 4
    },
    {
        "Category": "Education",
        "Creators Name": "Hairy Tornado",
        "About Paragraph": "Hairy Tornado combines humor with reselling expertise, offering a unique blend of entertainment and information. His channel features content on finding and selling items for profit, with a focus on humorous anecdotes and practical advice. Hairy Tornado’s engaging style makes learning about reselling both fun and informative, providing viewers with actionable tips and strategies for success.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCMwfatunsnAfRqaQBDD1uUw",
        "Youtube Followers": "389K",
        "instagram_url": "http://instagram.com/hairytornado",
        "Instagram Followers": "46.8K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 6
    },
    {
        "Category": "Commentary",
        "Creators Name": "NachoAverageeFinds",
        "About Paragraph": "NachoAverageeFinds provides insightful reviews and commentary on various topics through their YouTube channel. Their content features detailed analysis, thoughtful perspectives, and engaging discussions, offering viewers a fresh look at current trends and popular subjects. NachoAverageeFinds’ channel is a valuable resource for those seeking informative and engaging content.",
        "Country": "United States",
        "youtube_url": "youtube.com/nachoaveragefinds",
        "Youtube Followers": "202K",
        "instagram_url": "https://www.instagram.com/nachoaveragefinds",
        "Instagram Followers": "7.9k",
        "tiktok_url": "https://www.tiktok.com/@nachoaveragefinds",
        "Tik Tok Followers": "26.6K\n",
        "id": 7
    },
    {
        "Category": "Fashion",
        "Creators Name": "Nico Leonard",
        "About Paragraph": "Nico Leonard provides insightful reviews and fun watch commentary on luxury watches. He is also a passionate fan of fast cars therefore you will see him at your favourite Formula 1 grand prix meeting people and sharing with people the love for cars and watches",
        "Country": "Northern Ireland",
        "youtube_url": "https://www.youtube.com/channel/UCXPXfAAo-yV6Y-0PZecwBLw",
        "Youtube Followers": "1.76M",
        "instagram_url": "https://www.instagram.com/nicoleonardvanderhorst/reels",
        "Instagram Followers": "368K",
        "tiktok_url": "https://www.tiktok.com/@nicovanderhorst",
        "Tik Tok Followers": "1.2M",
        "id": 8
    },
    {
        "Category": "Fashion",
        "Creators Name": "WearTesters",
        "About Paragraph": "The OG's on Youtube, the WearTesters offers detailed reviews and commentary on sneakers and sportswear through YouTube, Instagram, and their website. Their content includes comprehensive analysis, expert opinions, and engaging discussions on various footwear and sportswear products, providing viewers with valuable insights and recommendations.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCUAzh982ZbDziKIL8MxGmVA",
        "Youtube Followers": "869K",
        "instagram_url": "https://www.instagram.com/weartesters",
        "Instagram Followers": "108K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 9
    },
    {
        "Category": "Commentary",
        "Creators Name": "Slow Start",
        "About Paragraph": "Slow Start provides engaging reviews and commentary on a variety of Y2K topics through his YouTube channel. His content includes detailed analysis, thoughtful perspectives, and entertaining discussions, offering viewers a fresh and informative look at current trends and popular subjects. Slow Start’s channel is a valuable resource for entertainment, engaging, and insightful content.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCeHT-8JNjHz8p5U1vmrm8rg",
        "Youtube Followers": "164K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 10
    },
    {
        "Category": "Fashion",
        "Creators Name": "Seth Fowler",
        "About Paragraph": "Seth is without a doubt one of the most respected names in the world of sneakers. Having designed multiple signature sneakers of his own, and with a background in industrial design, Seth takes his unique perspective as a designer to the world of sneakerheads; sharing his thoughts on the newest Jordan and Yeezy releases. Any brand that is looking to align with an extremely professional and high-quality channel has found their perfect match in Seth Fowler.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCgtHJiyE6ZwaJO65tdudDfw",
        "Youtube Followers": "1.18M",
        "instagram_url": "https://www.instagram.com/realsethfowler",
        "Instagram Followers": "192K",
        "tiktok_url": "https://www.tiktok.com/@realsethfowler",
        "Tik Tok Followers": "77.6K",
        "id": 11
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Lorry Hill",
        "About Paragraph": "Lorry Hill delivers detailed reviews and commentary on a variety of topics surrounding plastic surgery and body modifications. Her content includes comprehensive analysis, critical reviews, and engaging discussions, providing viewers with a deeper understanding of the subjects she covers. Lorry’s thoughtful approach and engaging style make her channel a valuable resource for detailed commentary.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCnClOuzfbOj3ZcUKs2GahjA",
        "Youtube Followers": "508K",
        "instagram_url": "Instagram",
        "Instagram Followers": "127K",
        "tiktok_url": "TikTok",
        "Tik Tok Followers": 8790,
        "id": 12
    },
    {
        "Category": "Education",
        "Creators Name": "Evant Horizon",
        "About Paragraph": "Evant Horizon delivers insightful commentary on Space and Physics related topics through YouTube, Instagram, and TikTok. His content features engaging analysis, thoughtful perspectives, and detailed reviews, providing viewers with a well-rounded look at various subjects. Evant Horizon platforms are a valuable source for those seeking informed and engaging content.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC3iXLabMi-9v7RDRDMyLvSQ",
        "Youtube Followers": "694K",
        "instagram_url": "https://www.instagram.com/evanthorizon",
        "Instagram Followers": "305K",
        "tiktok_url": "https://www.tiktok.com/@evanthorizon",
        "Tik Tok Followers": "2.6M",
        "id": 13
    },
    {
        "Category": "Commentary",
        "Creators Name": "Cooper Neidecker",
        "About Paragraph": "Cooper Neidecker offers in-depth commentary reviews on viral content, and shares his insights across YouTube, Instagram, and TikTok. Cooper’s engaging style and comprehensive commentary make him a go-to source for everything going on in the world of social media.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCWTSOOYG0cfkUqsl-UUxVCA",
        "Youtube Followers": "1.25M",
        "instagram_url": "https://www.instagram.com/filmcooper",
        "Instagram Followers": "278K",
        "tiktok_url": "https://www.tiktok.com/@filmcooper",
        "Tik Tok Followers": "1.5M",
        "id": 14
    },
    {
        "Category": "Education",
        "Creators Name": "Car Questions Answered",
        "About Paragraph": "Brandon is a used car dealer, he created Car Questions Answered to share the ins and outs of the used car market. Through his channel, Brandon provides updates on the car market, what's happening at the dealer auctions, price changes, and what it's like being a dealer. With a goal to share information, Brandon helps people make the best decisions while buying a car and ultimately save money.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCKv3C7l0Q2IWkxl8xapGMgg",
        "Youtube Followers": "241K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 15
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Outdoor Chef Life",
        "About Paragraph": "Taku specializes in outdoor cooking, offering recipes and tips for cooking in various outdoor settings. His YouTube and Instagram channels provide engaging content on grilling, camping meals, and outdoor culinary techniques. His content caters to outdoor enthusiasts who enjoy cooking in nature and want to enhance their outdoor dining experiences. Viewers are always looking forwards to Taku’s next adventure.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCNqpN335uVY9Sx_ZK_WuOAA",
        "Youtube Followers": "736K",
        "instagram_url": "https://www.instagram.com/outdoorcheflife",
        "Instagram Followers": "241K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 16
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "DanCookedIt",
        "About Paragraph": "Daniel Gerstel, AKA DanCookedIt shares challenge videos ranging from cheapest to most expensive food, fast food hacks and everything in between. Dan's ability to create short form videos that draw people in and have them watch the video is second to none. If you're looking for someone who is going to bring millions of eyeballs to your brand, Dan is the man! ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCuuLy9wn33DAE7qNt7oVGww",
        "Youtube Followers": "702K",
        "instagram_url": "https://www.instagram.com/dancookedit/",
        "Instagram Followers": "107K",
        "tiktok_url": "https://www.tiktok.com/@dancookedit",
        "Tik Tok Followers": "464.5K",
        "id": 17
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "Fit Foodie Selma",
        "About Paragraph": "Fit Foodie Selma provides healthy IBS friendly recipes and cooking tips through her YouTube, Instagram, and TikTok channels. She focuses on nutritious and fitness-friendly meals, offering practical advice for maintaining a healthy lifestyle. Her content includes a range of delicious IBS friendly, gluten-free recipes and cooking techniques designed to appeal to health-conscious individuals. Her engaging style and emphasis on wellness make her a go-to resource for healthy cooking.",
        "Country": "Finland",
        "youtube_url": "https://www.youtube.com/channel/UCh-GXxkUCFItAvmkTlbnPTw",
        "Youtube Followers": "696K",
        "instagram_url": "https://www.instagram.com/fitfoodieselma/?hl=fi",
        "Instagram Followers": "1M",
        "tiktok_url": "https://www.tiktok.com/@fitfoodieselma?lang=en",
        "Tik Tok Followers": "1.1M",
        "id": 18
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "WpgEats",
        "About Paragraph": "WpgEats highlights the local food scene in Winnipeg through its Instagram channel. The account features reviews of local dining spots, food events, and culinary highlights from the Winnipeg area. It provides valuable insights into the city's food culture, offering recommendations and showcasing the best places to eat. WpgEats is a go-to source for food lovers looking to explore Winnipeg’s vibrant culinary landscape.",
        "Country": "Canada",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/wpgeats",
        "Instagram Followers": "98.5K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 19
    },
    {
        "Category": "Lifestle",
        "Creators Name": "CrochetByGenna",
        "About Paragraph": "CrochetByGenna offers crochet tutorials and crafting tips through YouTube, Instagram, and TikTok. Her channel features a variety of crochet projects suitable for all skill levels, from beginners to advanced crafters. Genna provides clear, step-by-step instructions and helpful tips to make crocheting accessible and enjoyable. Her content is ideal for those interested in developing their crochet skills.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCjkENfjiEaJZeQh20tNs_Qw",
        "Youtube Followers": "118K",
        "instagram_url": "https://www.instagram.com/crochetbygenna/reels/?hl=en",
        "Instagram Followers": "153K",
        "tiktok_url": "https://www.tiktok.com/@gennatatu",
        "Tik Tok Followers": "29.1K",
        "id": 20
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Allie Brinn",
        "About Paragraph": "Allie Brinn shares various pottery projects and crafting tutorials across YouTube, Instagram, and TikTok. Her content includes creative ideas for home decor and personal crafts. She provides step-by-step guides to help viewers replicate her projects. Allie’s tutorials often focus on practical and stylish solutions for everyday needs. She also has lifestyle content to keep followers engaged in her daily activities. ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCzF4WvfnMuK7QRWk3HTM_Mw",
        "Youtube Followers": "27.8K",
        "instagram_url": "https://www.instagram.com/alliebrinn",
        "Instagram Followers": "644K",
        "tiktok_url": "https://www.tiktok.com/@alliebrinn",
        "Tik Tok Followers": "1.2M",
        "id": 21
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Summer Mckeen",
        "About Paragraph": "Summer Mckeen shares lifestyle content across YouTube, Instagram, and TikTok.  Summer’s content is very organic, fashion-focused & fun. Summer has been in the space for 10 plus years! ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCiM8OI8ySYAoealLy-YRCbg",
        "Youtube Followers": "2.11M",
        "instagram_url": "https://www.instagram.com/summermckeen/?hl=en",
        "Instagram Followers": "1.7M",
        "tiktok_url": "https://www.tiktok.com/@summermckeen",
        "Tik Tok Followers": "675K",
        "id": 22
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Paloma the Peach",
        "About Paragraph": "Paloma the Peach offers fun and engaging DIY and craft content on YouTube, Instagram, and TikTok. Paloma's channel features a variety of creative projects for home decor and personal use. Paloma’s tutorials are designed to be approachable and inspiring, providing viewers with practical ideas and tips for their own crafting endeavors. Paloma's content is perfect for those looking to add a personal touch of creativity to their space.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCwgUKFG7wWcWtL8Pex_9olg",
        "Youtube Followers": "329K",
        "instagram_url": "https://www.instagram.com/palomathepeach",
        "Instagram Followers": "130K",
        "tiktok_url": "https://www.tiktok.com/@palomathepeach",
        "Tik Tok Followers": "13.2K",
        "id": 23
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Uncomfy & Company",
        "About Paragraph": "Uncomfy & Company provides unique DIY and craft content through YouTube, Instagram, and TikTok. Their projects are designed to be both creative and practical, offering fresh ideas for crafters. The channel features a variety of crafting techniques, business advice, and tutorials aimed at inspiring and engaging viewers. Uncomfy & Company’s content is perfect for those looking for inventive DIY solutions.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCQuRK-VFyCjf3VCqZkCDveA",
        "Youtube Followers": "398K",
        "instagram_url": "https://www.instagram.com/uncomfy.co",
        "Instagram Followers": "209K",
        "tiktok_url": "https://www.tiktok.com/@uncomfy.co",
        "Tik Tok Followers": "127.5K",
        "id": 24
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Garbo Zhu",
        "About Paragraph": "Garbo Zhu creates engaging DIY content with a focus on creative projects and crafts on Instagram, and TikTok. Her channel features a mix of artistic and practical projects, designed to inspire and challenge viewers. Garbo’s tutorials often include lifestyle, ceramic designs, and innovative ideas for crafters of all levels. Her content is perfect for those looking to explore new crafting possibilities.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCjkfjKQ5u6kSRuOFUDvsO0A",
        "Youtube Followers": "961.6K",
        "instagram_url": "https://www.instagram.com/garbo.zhu",
        "Instagram Followers": "950K",
        "tiktok_url": "https://www.tiktok.com/@garbo.zhu",
        "Tik Tok Followers": "961.6K",
        "id": 25
    },
    {
        "Category": "Beauty",
        "Creators Name": "Marlena Stell",
        "About Paragraph": "Marlena Stell is a beauty entrepreneur who offers beauty reviews, makeup tutorials, tips, and product recommendations. Her channel features detailed beauty routines, reviews and thoughts on the latest products. Marlena is well known in the beauty space, collaborating with some of the biggest names and brands around the world. She's managed to build her own cosmetic brand from $0 to $22 million in less than 5 years and continues to make an impact in the space.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCE1BqH-72EBs-siTbDAjOGQ",
        "Youtube Followers": "1.54M",
        "instagram_url": "https://www.instagram.com/marlenastell",
        "Instagram Followers": "664K",
        "tiktok_url": "https://www.tiktok.com/@themarlenastell",
        "Tik Tok Followers": "55.3K",
        "id": 26
    },
    {
        "Category": "Beauty",
        "Creators Name": "Justin Hickox",
        "About Paragraph": "Justin Hickox is a dedicated and passionate hair stylist renowned for his expertise in creating personalized, transformative looks for his clients. With years of experience in the industry, Justin has developed a keen eye for detail and a deep understanding of how to enhance each individual’s natural beauty through tailored haircuts and color treatments. His approach is rooted in a commitment to listening to his clients' needs, understanding their lifestyles, and blending creativity with practicality to deliver styles that are both fashionable and easy to maintain. Beyond his technical skills, Justin is known for his warm, approachable demeanor, making every visit to his channel a comfortable and enjoyable experience.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCTfRM6bqWXYyCcs_78ywftQ",
        "Youtube Followers": "48k",
        "instagram_url": "https://www.instagram.com/justin_hickox/reels/",
        "Instagram Followers": "32k",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 27
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "urmomsushi",
        "About Paragraph": "urmomsushi offers a unique blend of fashion and beauty content with a focus on contemporary trends and personal style. Her YouTube channel features detailed tutorials and product reviews, while Instagram and TikTok showcase daily fashion and beauty inspirations.",
        "Country": "Austria",
        "youtube_url": "https://www.youtube.com/channel/UCVUgjaDIy2i2LP4Dw0fCYJw",
        "Youtube Followers": "136.7K",
        "instagram_url": "instagram.com/urmom_sushi",
        "Instagram Followers": "68.7K",
        "tiktok_url": "https://www.tiktok.com/@urmom_sushi",
        "Tik Tok Followers": "319K",
        "id": 28
    },
    {
        "Category": "Fashion",
        "Creators Name": "Mac Rose",
        "About Paragraph": "Mac Rose is a professional stylist in New York City where she helps her clients to bring their own creativity. Mac Rose's content is very educational, fun content that helps inspire people to describe themselves in their own way through fashion. ",
        "Country": "United States",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/justmacrose/",
        "Instagram Followers": "170k",
        "tiktok_url": "https://www.tiktok.com/@justmacrose",
        "Tik Tok Followers": "582k",
        "id": 29
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Julie Cho",
        "About Paragraph": "Julie Cho’s content covers her daily life activities and Korean beauty and fashion trends. Her YouTube channel offers detailed beauty tutorials and fashion advice, while her Instagram showcases her stylish outfits and beauty routines.",
        "Country": "South Korea",
        "youtube_url": "https://www.youtube.com/channel/UCrn730gTjviQZomWvxSgZDg",
        "Youtube Followers": "255K",
        "instagram_url": "https://www.youtube.com/redirect?event=channel_description&redir_token=QUFFLUhqbEt4aGpwQ2hQVkVLVU5ISjFmZ0I3QUdRYW9XQXxBQ3Jtc0tsNUkxeW9RbEtwVDhBWkpWd0RBOFRQTU9WNzJQd2N6QUc5U2J5Q1JvR3lnYW9YTUZtYXB4YnhZV1lFM00tQUZvS2hicXRSbXFCLTJuQksyelZsaUY4ajU0cUZJT1pXcjVNMXFXQmItVTBBUEViZXJvaw&q=https%3A%2F%2Fwww.instagram.com%2Fjjuliecho%2F",
        "Instagram Followers": "121k",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 30
    },
    {
        "Category": "Adventure",
        "Creators Name": "Luke Eich",
        "About Paragraph": "Luke Eich’s channel focuses life in NY and fashion with a modern approach. His channels include comedy,product reviews, and personal vlogs on a variety of topics.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCUnOjJ0SRzmN7pD8UPugsMA",
        "Youtube Followers": "414K",
        "instagram_url": "https://www.instagram.com/luke_eich",
        "Instagram Followers": "89.1K",
        "tiktok_url": "https://www.tiktok.com/@luke_eich",
        "Tik Tok Followers": "178.5K",
        "id": 31
    },
    {
        "Category": "Lfestyle",
        "Creators Name": "Bianca Gan",
        "About Paragraph": "Bianca Gan’s channel is a glamorous exploration of luxury fashion and beauty. She shares detailed fashion tips, from outfit inspirations to trend analysis, and provides beauty tutorials that enhance her sophisticated look. Her channel is ideal for those who want to stay on top of fashion trends while enjoying a touch of elegance and glamour and aesthetic content in their everyday lives.",
        "Country": "Philippines",
        "youtube_url": "https://www.youtube.com/channel/UCNOd2-ANXAeFCNmniKKFleQ",
        "Youtube Followers": "205K",
        "instagram_url": "https://www.instagram.com/biancagan",
        "Instagram Followers": "80.7K",
        "tiktok_url": "https://www.tiktok.com/@bianca_gan",
        "Tik Tok Followers": "26.1K",
        "id": 32
    },
    {
        "Category": "",
        "Creators Name": "Emo from Whoville",
        "About Paragraph": "Lauren's prowess in video editing has made her one of the top creators in the fan edits community. Her viral \"Undercover\" video series tackling fandoms from Sabrina Carpenter to Dance Moms is beloved by subscribers.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCgbiGqt8aLTNyhf43w_NuBg",
        "Youtube Followers": "713K",
        "instagram_url": "https://www.instagram.com/lolabugxd",
        "Instagram Followers": "83.3K",
        "tiktok_url": "https://www.tiktok.com/@candacevfx",
        "Tik Tok Followers": "1.1M",
        "id": 33
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Miss Katie",
        "About Paragraph": "Miss Katie is a vibrant creator with and engaging and relatable personality. With a focus on lifestyle, personal growth, and creative expression, she connects with her audience through her thoughtful and inspiring content. Whether she's sharing insights on day-to-day living, exploring new ideas, or encouraging her followers to embrace their individuality, Miss Katie brings warmth and authenticity to everything she does. Her creative approach and genuine connection with her community have made her a beloved figure in the digital space.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCFldqmSKhOZQZdfUuPMJjpw",
        "Youtube Followers": "221k",
        "instagram_url": "https://www.instagram.com/heymisskatie",
        "Instagram Followers": "73k",
        "tiktok_url": "https://www.tiktok.com/@heymisskatiee",
        "Tik Tok Followers": "84k",
        "id": 34
    },
    {
        "Category": "Education",
        "Creators Name": "CS Jackie",
        "About Paragraph": "CS Jackie offers insights into her life as an engineer, book lover, and coffee drinker. Jackie’s channel combines work advice with practical lifestyle tips, her content is perfect for those who want to balance elegance with functionality in their fashion and lifestyle choices.",
        "Country": "United Kingdom",
        "youtube_url": "https://www.youtube.com/channel/UCR0l-DhuoKVZKJXXccr-2FA",
        "Youtube Followers": "79.1K",
        "instagram_url": "https://www.instagram.com/csjack9",
        "Instagram Followers": "124K",
        "tiktok_url": "https://www.tiktok.com/@csjackie",
        "Tik Tok Followers": "138.8K",
        "id": 35
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Darin and Josh",
        "About Paragraph": "Darin and Josh are a husband and wife who share their experiences with family and raising their two kids. On their channel you will learn new recipes, kids lunch ideas, fun family activities, and gain new insights on raising kids.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCtYKHIlCv9OlTVVFEOrA3fw",
        "Youtube Followers": "11k",
        "instagram_url": "https://www.instagram.com/darin_nicole",
        "Instagram Followers": "58k",
        "tiktok_url": "https://www.tiktok.com/@darinandjosh",
        "Tik Tok Followers": "923k",
        "id": 36
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Cup of Jasmine",
        "About Paragraph": "Cup of Jasmine is a tattoo artist that lives in NY. She provides a luxurious lifestyle experience through her diverse content on fashion, beauty, and home decor. Her channel features high-end fashion looks, beauty tips, and a peek into her stylish daily life, showcasing how luxury can be seamlessly integrated into everyday activities. Jasmien’s content is designed to inspire viewers with sophisticated style ideas and practical tips for maintaining a glamorous lifestyle. Her approach combines elegance with a personal touch, making her channel a valuable resource for luxury enthusiasts.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCzH-UT7eOGpsMC_al8ZQmOQ",
        "Youtube Followers": "537K",
        "instagram_url": "https://www.instagram.com/jaschann/",
        "Instagram Followers": "97.7K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 37
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Maya Lee",
        "About Paragraph": "Maya Lee’s channels are about her life, activites, and lifestyle with an elegant touch. She shares fashion tips that showcase stylish outfits, beauty routines that enhance her chic appearance, and lifestyle vlogs that offer a glimpse into her sophisticated daily life. Maya’s content provides a glamorous and refined view of modern living, making it a great resource for those seeking inspiration in both fashion and lifestyle.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC5RByeSeEN_aGhg1fq0TQWA",
        "Youtube Followers": "531K",
        "instagram_url": "https://www.instagram.com/mayaleex3",
        "Instagram Followers": "54.1K",
        "tiktok_url": "https://www.tiktok.com/@mayaleex3",
        "Tik Tok Followers": "68K",
        "id": 38
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Erika Diane",
        "About Paragraph": "Almost Captain Morgan offers a blend of flying adventures and pilot life, showcasing their experiences. The channel includes detailed vlogs of their journeys, tips for travelling enthusiasts, and insights into various travel destinations.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCiU62OZdeYaOWzryECkxROA",
        "Youtube Followers": "1.5M",
        "instagram_url": "https://www.instagram.com/erikadianeyt",
        "Instagram Followers": "321K",
        "tiktok_url": "https://www.tiktok.com/@noterikadiane",
        "Tik Tok Followers": "609.2K\n",
        "id": 39
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "fayefilms",
        "About Paragraph": "Fayefilms showcases a luxurious lifestyle through fashion, beauty, and travel content. Her channel features high-end fashion looks, beauty tips, and travel vlogs, offering a glamorous view of modern living.",
        "Country": "Australia",
        "youtube_url": "https://www.youtube.com/channel/UCsJfDna-9xsG-NmM0kwgEkg",
        "Youtube Followers": "1.19M",
        "instagram_url": "https://www.instagram.com/ngfayee",
        "Instagram Followers": "120K",
        "tiktok_url": "https://www.tiktok.com/@fayefilms",
        "Tik Tok Followers": "38.8K",
        "id": 40
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Katelyn Dewitt",
        "About Paragraph": "Katelyn Dewitt’s channel offers a day in the life of a NYC university student, showing beauty routines, budgeting and even traveling around the world. You’ll find a blend of practical advice and personal insights that reflect her everyday life in NYC. Whether you're a fellow student, a beauty enthusiast, or a travel lover, there’s something here for you. Join me Katelyn as she navigates the highs and lows of student life, and let’s inspire each other to live our best lives!",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCjF2H4EytmSmTM129GL2C7w",
        "Youtube Followers": "296K",
        "instagram_url": "https://www.instagram.com/katelyndewitt_",
        "Instagram Followers": "28.5K",
        "tiktok_url": "https://www.tiktok.com/@katelyndewitt_",
        "Tik Tok Followers": "25.9K",
        "id": 41
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Yoora Jung",
        "About Paragraph": "Yoora Jung creates content on luxury fashion and lifestyle with a sophisticated and stylish approach. Her channel features fashion tips that highlight high-end trends, beauty routines that reflect her chic look, and personal vlogs that offer a glimpse into her upscale living. Yoora’s content is perfect for viewers who want to stay updated on luxury fashion and enjoy a refined perspective on modern living.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCeGUqJFEuNCiECPrHMup3tg",
        "Youtube Followers": "2.04M",
        "instagram_url": "https://www.instagram.com/yoorajung",
        "Instagram Followers": "291K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 42
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Zhirelle",
        "About Paragraph": "Zhirelle is a creative and expressive individual who has built a strong connection with her audience through her engaging and authentic content. With a passion for fashion, beauty, and lifestyle topics, she shares her unique perspective and creative ideas, inspiring others to embrace their own personal style and self-expression. Zhirelle's approach to content creation is rooted in her genuine desire to connect with her followers and offer valuable insights, tips, and inspiration. Her warm personality and relatable presence have made her a beloved figure in her community, where she continues to influence and inspire with every post.",
        "Country": "",
        "youtube_url": "https://www.youtube.com/channel/UCGoiclUrJhOA14waY85_D5w",
        "Youtube Followers": "763k",
        "instagram_url": "https://www.instagram.com/zhirelle",
        "Instagram Followers": "88k",
        "tiktok_url": "https://www.tiktok.com/@zhirelle",
        "Tik Tok Followers": "80k",
        "id": 43
    },
    {
        "Category": "Fashion",
        "Creators Name": "Taylor Reed",
        "About Paragraph": "Taylor Reed offers comprehensive menswear fashion content, focusing on style tips, outfit inspiration, and fashion reviews. His channel helps men enhance their wardrobe with practical advice on current trends and classic styles. Taylor’s content is perfect for those seeking to improve their fashion sense and stay stylish.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCjhcYH8uoQPtAxwDCalFm3Q",
        "Youtube Followers": "5.91K",
        "instagram_url": "https://www.instagram.com/treedfl",
        "Instagram Followers": "199K",
        "tiktok_url": "https://www.tiktok.com/@treedfl",
        "Tik Tok Followers": "332.3K\n",
        "id": 44
    },
    {
        "Category": "Fashion",
        "Creators Name": "Connor Chase",
        "About Paragraph": "Connor Chase explores the world of fashion and menswear through his engaging content. His channel features fashion tips, outfit ideas, and personal style insights. Connor helps viewers enhance their wardrobe by showcasing his unique take on his own personal style.",
        "Country": "United States",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/bigceasars/?hl=en",
        "Instagram Followers": "39.5K",
        "tiktok_url": "https://www.tiktok.com/@ipeakedinsecondgrade?_t=8dmfbxgnqgv&_r=1",
        "Tik Tok Followers": "133.4K",
        "id": 45
    },
    {
        "Category": "Fashion",
        "Creators Name": "Bryce Kicks",
        "About Paragraph": "Bryce Kicks dives deep into sneaker culture and menswear, offering detailed sneaker reviews, fashion tips, and lifestyle content. His content is perfect for sneaker enthusiasts and fashion-forward individuals interested in the latest trends. Bryce combines his passion for sneakers and clothing with practical style advice to help viewers elevate their fashion game.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UC8nsuBojRu68S6CKL_W8hig",
        "Youtube Followers": "158K",
        "instagram_url": "https://www.instagram.com/brycekicks",
        "Instagram Followers": "39.1K",
        "tiktok_url": "https://www.tiktok.com/@brycekicks",
        "Tik Tok Followers": "111.9K",
        "id": 46
    },
    {
        "Category": "Fashion",
        "Creators Name": "David James Elliott",
        "About Paragraph": "David James Elliott provides insightful and approachable content on menswear, featuring style tips, outfit inspirations, and clothing reviews. His channel aims to help the 'every-man' enhance their personal style with practical advice and trend updates. David’s content is well-suited for those looking to build a stylish and versatile wardrobe.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCwMUYbULXxFE81guSql0J_A",
        "Youtube Followers": 205,
        "instagram_url": "https://www.instagram.com/david.james.elliott/?hl=en",
        "Instagram Followers": "98.2K",
        "tiktok_url": "https://www.tiktok.com/@david.james.elliott",
        "Tik Tok Followers": "173.7K",
        "id": 47
    },
    {
        "Category": "Fashion",
        "Creators Name": "Johnny Thai",
        "About Paragraph": "Johnny Thai provides insights into menswear fashion, focusing on streetwear and modern style trends. His content includes style tips, outfit ideas, and personal fashion advice aimed at helping men expand their fashion knowledge base. Johnny’s channel is a valuable resource for those seeking to refine their personal style and get inspiration. ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCiWMV3RA6jpYNGZWTbjFneA",
        "Youtube Followers": "247K",
        "instagram_url": "https://www.instagram.com/flywithjohnnythai",
        "Instagram Followers": "115K",
        "tiktok_url": "https://www.tiktok.com/@flywithjohnnythai",
        "Tik Tok Followers": "144K",
        "id": 48
    },
    {
        "Category": "Fashion",
        "Creators Name": "The Iron Snail",
        "About Paragraph": "The Iron Snail delivers a diverse range of content related to menswear fashion, offering comprehensive style guides and insights into the latest fashion trends. The channel is dedicated to providing practical advice on how to build a well-rounded wardrobe and create polished outfits for various occasions. Viewers can expect detailed reviews of clothing items, fashion tips, and personal outfit ideas that cater to different styles. The Iron Snail aims to help men enhance their fashion sense and stay stylish.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC-0kjvCj9Z_pL_yH648Uq7w",
        "Youtube Followers": "159K",
        "instagram_url": "https://www.instagram.com/michaelkristy_",
        "Instagram Followers": 8855,
        "tiktok_url": "https://www.tiktok.com/@theironsnail",
        "Tik Tok Followers": 7864,
        "id": 49
    },
    {
        "Category": "Adventure",
        "Creators Name": "TheLoneSol",
        "About Paragraph": "Growing up the daughter of nomads, Isabella knew she would one day hit it off on her own. Living that #vanlife has always suited her as she's now travelling around the US finding the best hikes and scenic spots.",
        "Country": "United States",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/thelonesol",
        "Instagram Followers": "87.8K",
        "tiktok_url": "https://www.tiktok.com/@thelonesol",
        "Tik Tok Followers": "81.9K",
        "id": 50
    },
    {
        "Category": "Adventure",
        "Creators Name": "Abigail Martin",
        "About Paragraph": "If you like van-life, travel and adventure then you'll fall in love with Abiagil's content. Her bubbly personality shines through, while still giving insightful tips on how to live the van life.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCktRX-Kx38hreZ0zw_LcPkg",
        "Youtube Followers": "5.11K",
        "instagram_url": "https://www.instagram.com/abigailhmartin",
        "Instagram Followers": "294K",
        "tiktok_url": "https://www.tiktok.com/@abigailmartiin",
        "Tik Tok Followers": "1.2M",
        "id": 51
    },
    {
        "Category": "Adventure",
        "Creators Name": "Liveration",
        "About Paragraph": "Liveration is a channel hosted by Ryan and Sophie Caffrey. They share content related to unique living situations, tiny homes, and homesteading. Ryan and Sophie will tour these unique homes and interview the owners to learn about what drove them to choose an unconvential home. Liveration will provide you will stories, practical living advice, and a new perspective on what makes a house a home.",
        "Country": "England",
        "youtube_url": "https://www.youtube.com/channel/UC8p_Cbta-EmoejtyzA8pFOA",
        "Youtube Followers": "57.7K",
        "instagram_url": "https://www.instagram.com/_liveration/",
        "Instagram Followers": "",
        "tiktok_url": "https://www.tiktok.com/@liveration",
        "Tik Tok Followers": "24.1K",
        "id": 52
    },
    {
        "Category": "Adventure",
        "Creators Name": "Sailing Zatara",
        "About Paragraph": "Provides sailing adventures, outdoor living tips, and survival skills. The channel focuses on life aboard a sailboat and how to navigate challenges on the water. Most recently, they became empty nesters therefore, they have been sharing their new chapter of life as retired professionals who sail through the Atlantic coast and share with their audience the ocean beauty",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCNYlvlreZiRRHo_v5Nmrfow",
        "Youtube Followers": "609K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 53
    },
    {
        "Category": "Adventure",
        "Creators Name": "Wild Homestead",
        "About Paragraph": "James from Wild Homestead offers comedic insights into homesteading, outdoor living, and survival skills. The channel provides tips for self-sufficient living and building up a homestead, with no prior experience.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCstLIadsuuLmDdIzMZxesfg",
        "Youtube Followers": "110K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 54
    },
    {
        "Category": "Adventure",
        "Creators Name": "Living Big In A Tiny House",
        "About Paragraph": "Living Big In A Tiny House is a superb YouTube channel hosted by Bryce Langston that's all about tiny living and super cool small-space designs. With over 5 million followers across all his platforms, Bryce will take you on tours of these really unique tiny homes from everywhere, chatting with the owners and showing off the clever, creative ways they've made these small spaces feel huge. His viewers are treated to insightful stories, creative solutions, and sustainable living concepts that redefine the traditional notions of home living.",
        "Country": "New Zealand",
        "youtube_url": "youtube.com/livingbig",
        "Youtube Followers": "4.59M",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 55
    },
    {
        "Category": "Adventure",
        "Creators Name": "Adam Stew",
        "About Paragraph": "Adam shares valuable outdoor survival tips, adventure vlogs, and in-depth nature explorations. Adam is often accompanied by his dog, Chester, and his content focuses on their adventures through the Canadian wilderness.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCImE4SlRS79SqsMfLMol-6g",
        "Youtube Followers": "137K",
        "instagram_url": "https://www.instagram.com/adamstew_/?hl=en",
        "Instagram Followers": 8156,
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 56
    },
    {
        "Category": "Adventure",
        "Creators Name": "Tiny Cabin Life",
        "About Paragraph": "Jack has built multiple amazing portable tiny cabins, and he features all of his adventures and experiences living remote areas in these cabins. His content is relaxing and immersive, often showcasing his life in the wilderness with his wife, daughter and dog Ellie. Viewers can experience nature vicariously through his content.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCHJy1RypctP_ozyxaLTXlBg",
        "Youtube Followers": "173K",
        "instagram_url": "https://www.instagram.com/jackfsteward",
        "Instagram Followers": 9166,
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 57
    },
    {
        "Category": "Adventure",
        "Creators Name": "Fishin with Tate",
        "About Paragraph": "Shares exciting fishing adventures, tips for improving your fishing skills, and survival skills related to outdoor activities. Tate’s content is perfect for fishing and hunting enthusiasts and adventurers.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCj4b7LgnN5uQ56-D7g3PEFw",
        "Youtube Followers": "664K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "https://www.tiktok.com/@fishinwithtate",
        "Tik Tok Followers": "1.3M",
        "id": 58
    },
    {
        "Category": "Adventure",
        "Creators Name": "Madison Clysdale",
        "About Paragraph": "Provides content on outdoor adventures, survival tips, and nature exploration. Madison’s channel offers inspiring and practical insights for exploring the outdoors. She is an avid motorcyclist and loves traveling with dog Kero!",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UCqpNHx_gjAV70G-H1jZMpOg",
        "Youtube Followers": "364K",
        "instagram_url": "https://www.instagram.com/madisonclysdalee",
        "Instagram Followers": "171K",
        "tiktok_url": "https://www.tiktok.com/@madisonclysdalee",
        "Tik Tok Followers": "127.7K",
        "id": 59
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "NorCal Cycling",
        "About Paragraph": "NorCal Cycling offers content on the art of cycling and race POV's. The channel includes cycling tips, gear reviews, and insights into maintaining a healthy and active lifestyle. NorCal Cycling is ideal for cycling enthusiasts and those interested in the competitive cycling scene.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCIfRR1N2Gm1vjj9X955iWSQ",
        "Youtube Followers": "188K",
        "instagram_url": "https://www.instagram.com/norcal.cycling",
        "Instagram Followers": "23.9K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 60
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "The Hockey Guys",
        "About Paragraph": "The Hockey Guys are best friends sharing their lifestyle as best friends. They started as college hockey players and now share their healthy lifestyle as creators in Minneapolis. ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCBkCk2wNOHnPTcmXmoRSL8Q",
        "Youtube Followers": "52.4K",
        "instagram_url": "https://www.instagram.com/the.hockeyguys",
        "Instagram Followers": "235K",
        "tiktok_url": "https://www.tiktok.com/@thehockeyguys",
        "Tik Tok Followers": "1.5M",
        "id": 61
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "COLLADOTV",
        "About Paragraph": "Adrian Collado creates comedic basketball skits around anything happening within that realm. Adrian's ability to incorporate brands into his content at a high level shines as he's worked with a vast variety of brands ranging from phone cases, sports apparel, insoles and drinks. If you're looking for a creator that can promote your brand in a fun, energetic way, Adrian should be your go to!  ",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCneCagRhvfpuR23tzzZQcug",
        "Youtube Followers": "1.35M",
        "instagram_url": "https://www.instagram.com/colladotv",
        "Instagram Followers": "607K",
        "tiktok_url": "https://www.tiktok.com/@colladotv",
        "Tik Tok Followers": "2.2M",
        "id": 62
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "Steve Cole",
        "About Paragraph": "Steve Cole shares content on fitness training, Swimming, and personal wellness. His channel features exercise guides, fitness challenges, and motivational advice for achieving physical fitness. Steve’s content is designed to inspire and support viewers in their fitness journeys.",
        "Country": "United States",
        "youtube_url": "",
        "Youtube Followers": "",
        "instagram_url": "https://www.instagram.com/stevecole__",
        "Instagram Followers": "286K",
        "tiktok_url": "https://www.tiktok.com/@steve__cole",
        "Tik Tok Followers": "448.7K",
        "id": 63
    },
    {
        "Category": "Sports & Fitness",
        "Creators Name": "Birdogey",
        "About Paragraph": "Birdogey - noun: Three-putting the birdie putt and turning it into a bogey. No one says golf is easy, and no one knows this better than Birdogey. Brady shares his passion for golf as an average golfer, experiencing the highest of highs and the lowest of lows, his witty humor and wry comments make for excellent entertainment that anyone can relate to.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCzRc6-PBKGWYPksaAbkK_xA",
        "Youtube Followers": "37.1K",
        "instagram_url": "https://www.instagram.com/birdogey",
        "Instagram Followers": "254K",
        "tiktok_url": "https://www.tiktok.com/@birdogey",
        "Tik Tok Followers": "433.5K",
        "id": 64
    },
    {
        "Category": "Tech",
        "Creators Name": "AppleTrack",
        "About Paragraph": "AppleTrack provides the latest news and updates on Apple products, including reviews, comparisons, and rumors. The channel offers in-depth analysis of Apple devices and software, keeping viewers informed about the newest releases and tech advancements. AppleTrack is ideal for Apple enthusiasts looking for comprehensive updates and reviews.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC2VrA-oteANZQ07TquwBvAQ",
        "Youtube Followers": "476K",
        "instagram_url": "https://www.instagram.com/imsamkohl",
        "Instagram Followers": 6603,
        "tiktok_url": "https://www.tiktok.com/@imsamkohl",
        "Tik Tok Followers": "175.3K",
        "id": 65
    },
    {
        "Category": "Tech",
        "Creators Name": "Front Page Tech",
        "About Paragraph": "Front Page Tech delivers the latest news and reviews on technology, with a focus on Apple products and industry trends. With a focus on editorialized storytelling in 2024, Jon Prosser and team have taken the channel to new heights, all the while maintaining the charm and humor that FPT fans have been enjoying for 10+ years.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC8jkbVLPvztz8TuE98OYo8Q",
        "Youtube Followers": "508K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 66
    },
    {
        "Category": "Tech",
        "Creators Name": "Dantic",
        "About Paragraph": "Dantic specializes in technology reviews, gaming setups, and news from the tech world. The channel features detailed breakdowns of various tech, desk setups, and tech trends. Dantic’s content is designed to keep viewers informed about the latest innovations and provide practical advice on technology use.",
        "Country": "United Kingdom",
        "youtube_url": "https://www.youtube.com/channel/UCNNdYhLEd4aAivW_V9GNOMQ",
        "Youtube Followers": "212K",
        "instagram_url": "https://www.instagram.com/dantic.ig/",
        "Instagram Followers": "177K",
        "tiktok_url": "https://www.tiktok.com/@dantic_",
        "Tik Tok Followers": "1M",
        "id": 67
    },
    {
        "Category": "Tech",
        "Creators Name": "Luke Miani",
        "About Paragraph": "Luke Miani provides detailed reviews and insights into computers and Apple products, including gadgets, software, and tech accessories. His channel features comprehensive reviews, unboxings, and comparisons of Apple devices. Luke’s content is designed for Apple enthusiasts seeking in-depth analysis and updates on the latest Apple tech.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC3c8H4Tlnm5M6pXsVMGnmNg",
        "Youtube Followers": "501K",
        "instagram_url": "https://www.instagram.com/mianiluke",
        "Instagram Followers": 5333,
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 68
    },
    {
        "Category": "Travel",
        "Creators Name": "Jetting Julia",
        "About Paragraph": "Jetting Julia offers travel vlogs and adventure content, showcasing her explorations around the world as a flight attendant. The channel features detailed travel guides, destination highlights, and personal experiences from her journeys. Julia provides valuable insights and tips for fellow travelers.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCkRiPY0hPYZh96RQShizu6w",
        "Youtube Followers": "148K",
        "instagram_url": "https://www.instagram.com/jettingjulia",
        "Instagram Followers": "27.2K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 69
    },
    {
        "Category": "Travel",
        "Creators Name": "Doug Barnard",
        "About Paragraph": "A former e-commerce marketer, Doug decided to take the path less traveled and make a career highlighting the places less travelled. Whether that's vlogging from his current home in Turkey, on the road in Bangladesh and Saudi Arabia, or guiding tours and excursions in Iraq, Doug's ability to share his love for new countries and experiences has made him one of the fastest growing travel creators.",
        "Country": "Turkey",
        "youtube_url": "https://www.youtube.com/channel/UCLt0VD58m_3DpKVrrfkGAcA",
        "Youtube Followers": "578K",
        "instagram_url": "https://www.instagram.com/doug_barnard",
        "Instagram Followers": "113K",
        "tiktok_url": "https://www.tiktok.com/@doug_barnard",
        "Tik Tok Followers": "206.3K",
        "id": 70
    },
    {
        "Category": "Travel",
        "Creators Name": "Chris Rogers",
        "About Paragraph": "Chris Rogers explores various travel destinations and outdoor adventures, providing viewers with engaging content on his journeys. The channel features travel guides, destination reviews, and personal experiences from his travels around the world.",
        "Country": "",
        "youtube_url": "https://www.youtube.com/channel/UCey7V2zwnjaxPKhfJ0sYE4g",
        "Youtube Followers": "382K",
        "instagram_url": "https://www.instagram.com/chrisrogers",
        "Instagram Followers": 1105,
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 71
    },
    {
        "Category": "Travel",
        "Creators Name": "Almost Captain Morgan",
        "About Paragraph": "Almost Captain Morgan offers a blend of flying adventures and pilot life, showcasing their experiences. The channel includes detailed vlogs of their journeys, tips for travelling enthusiasts, and insights into various travel destinations.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCHtogAjutLIVOo0kfjzP1BA",
        "Youtube Followers": "100K",
        "instagram_url": "https://www.instagram.com/almostcaptainmorgan",
        "Instagram Followers": "197K",
        "tiktok_url": "https://www.tiktok.com/@almostcaptainmorgan",
        "Tik Tok Followers": "641.7K\n",
        "id": 72
    },
    {
        "Category": "Travel",
        "Creators Name": "Tayo Aina",
        "About Paragraph": "Tayo Aina provides travel documentaries on specific topics about various places in the world, mainly focusing on America, The Caribbean, Europe and Africa. Tayo has become an educator of the world being able to learn first hand from the people living in each place in the world, their meaning of life and how they appreciate the small things. ",
        "Country": "Portugal",
        "youtube_url": "https://www.youtube.com/channel/UC8p_y3iHPe-n3zRfXK2czWA",
        "Youtube Followers": "917K",
        "instagram_url": "https://www.instagram.com/tayoainafilms",
        "Instagram Followers": "264K",
        "tiktok_url": "https://www.tiktok.com/@tayoainafilms",
        "Tik Tok Followers": "135K",
        "id": 73
    },
    {
        "Category": "Outdoors & Adventure",
        "Creators Name": "Levi Kelly",
        "About Paragraph": "Levi Kelly shares his travel adventures, tiny cabins, and outdoor explorations, featuring vlogs of various destinations and activities. The channel includes airbnb, travel tips, destination ad cabin reviews, and personal stories from his journeys, providing viewers with engaging and informative content.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UC3hEhxxlq9OWXWp4t4uYXKw",
        "Youtube Followers": "677K",
        "instagram_url": "https://www.instagram.com/levimkelly",
        "Instagram Followers": "179K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 74
    },
    {
        "Category": "Outdoors & Adventure",
        "Creators Name": "Mike Will Travel",
        "About Paragraph": "Mike Will Travel offers travel vlogs and adventure content, showcasing his explorations and experiences around the world find and showcase the world's most unique airbnb accommodations. The channel includes detailed destination guides, accommodation reviews, travel tips, and personal stories from his journeys.",
        "Country": "",
        "youtube_url": "https://www.youtube.com/channel/UCCwIhMeDiH7nKCt1U19tK9w",
        "Youtube Followers": "186K",
        "instagram_url": "https://www.instagram.com/mikewilltravel",
        "Instagram Followers": "54.6K",
        "tiktok_url": "https://www.tiktok.com/@mikewilltravel",
        "Tik Tok Followers": "54.4K",
        "id": 75
    },
    {
        "Category": "Travel",
        "Creators Name": "Norma Geli",
        "About Paragraph": "Norma Geli provides travel and adventure content, featuring vlogs of her explorations and insights to show you how to love and explore Las Vegas. The channel includes travel tips, destination highlights, and personal experiences from her travels.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCKzef9jZ6SGmv3eWpWFJrjg",
        "Youtube Followers": "173K",
        "instagram_url": "https://www.instagram.com/norma.geli",
        "Instagram Followers": "43.2K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 76
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Adam J Bell",
        "About Paragraph": "Your weekly motivation to get the bread. Adam is a full time realtor and part-time comedian and content creator. The behind-the-scenes of building his business & staying accountable one week at a time.",
        "Country": "Canada",
        "youtube_url": "https://www.youtube.com/channel/UC2eh9rAOHsLuTTGwZQiHTyg",
        "Youtube Followers": "59.1K",
        "instagram_url": "https://www.instagram.com/theadamjbell",
        "Instagram Followers": "16.6K",
        "tiktok_url": "https://www.tiktok.com/@theadamjbell",
        "Tik Tok Followers": "14.8K",
        "id": 77
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Cole Hastings",
        "About Paragraph": "Cole Hastings provides content aimed at fostering personal empowerment and mental well-being. His videos cover topics such as mindset shifts, personal development strategies, and practical tools for overcoming challenges and enhancing life quality.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UCwQnoax3HWID1WOzZ4mqLPQ",
        "Youtube Followers": "686K",
        "instagram_url": "https://www.instagram.com/colehastings_",
        "Instagram Followers": "56.9K",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 78
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Nika Erculj",
        "About Paragraph": "Nika Erculj delivers content centered on personal empowerment, mindfulness, and self-improvement. Her videos explore various techniques for enhancing mental health, building positive habits, and achieving personal growth, helping viewers lead more empowered lives.",
        "Country": "Slovenia",
        "youtube_url": "https://www.youtube.com/channel/UC29LPjVrRNOY1Ma2r6O3rdw",
        "Youtube Followers": "448K",
        "instagram_url": "",
        "Instagram Followers": "",
        "tiktok_url": "",
        "Tik Tok Followers": "",
        "id": 79
    },
    {
        "Category": "Lifestyle",
        "Creators Name": "Alivia D'Andrea",
        "About Paragraph": "Alivia D'Andrea shares content focused on personal growth, wellness, and empowerment. Her channel features a variety of videos, including motivational talks, self-care tips, and practical advice for building confidence and achieving personal goals.",
        "Country": "United States",
        "youtube_url": "https://www.youtube.com/channel/UChIjQmxk48Fn8UYdJH2NaoQ",
        "Youtube Followers": "2.41M",
        "instagram_url": "https://www.instagram.com/aliviadandrea/",
        "Instagram Followers": "219K",
        "tiktok_url": "https://www.tiktok.com/@aliviadandrea",
        "Tik Tok Followers": "78.1K",
        "id": 80
    }
]